DISCIPLINES = {
    "Прикладной анализ данных и искусственный интеллект": [
        "Математический анализ 1",
        "Математический анализ 2",
        "Линейная алгебра",
        "Дискретная математика",
        "Теория вероятностей и математическая статистика",
        "Python для анализа данных",
        "Основы машинного обучения",
        "Машинное обучение",
        "Машинное обучение на больших данных",
        "Компьютерное зрение",
        "Анализ изображений",
        "Рекомендательные системы",
        "Методы интерпретации и визуализации данных",
        "Дополнительные главы машинного обучения",
        "Дифференциальные уравнения",
        "Численные методы и методы оптимизации",
        "Алгоритмы и структуры данных",
        "Базы данных",
        "Основы и методология программирования",
        "Язык программирования C++",
        "Архитектура компьютера и операционные системы",
    ],

    "Прикладная математика и информатика": [
        "Математический анализ 1",
        "Математический анализ 2",
        "Линейная алгебра и геометрия",
        "Дискретная математика",
        "Теория вероятностей и математическая статистика",
        "Алгоритмы и структуры данных",
        "Базы данных",
        "Параллельное программирование",
        "Веб-поиск и ранжирование"
        "Основы и методология программирования",
        "Язык программирования C++",
        "Программирование на GPU",
        "Архитектура компьютера и операционные системы",
        "Разработка программного обеспечения",
    ],

    "Физика": [
        "Физика",
        "Механика",
        "Аналитическая механика",
        "Электричество и магнетизм",
        "Электродинамика сплошных сред",
        "Термодинамика и молекулярная физика",
        "Оптика",
        "Квантовая механика",
        "Статистическая физика",
        "Математическая физика",
        "Математический аппарат физики",
        "Физика конденсированного состояния",
        "Калибровочные теории",
        "Квантовый транспорт",
        "Асимптотики в задачах математической физики"
    ],

    "Программирование и инжиниринг компьютерных игр": [
        "Основы и методология программирования",
        "Язык программирования C++",
        "Алгоритмы и структуры данных",
        "Эффективные алгоритмы",
        "Компьютерная графика",
        "Программирование на GPU",
        "Архитектура компьютера и операционные системы",
        "Разработка программного обеспечения",
        "Unix и скриптовые языки"
    ],

    "Компьютерные технологии, системы и сети": [
        "Архитектура компьютера и операционные системы",
        "Технологии компьютерных сетей",
        "Параллельное программирование",
        "Алгоритмы для хранения данных",
        "Базы данных",
        "ИТ-архитектура предприятия",
        "Системный анализ и разработка сложных информационных систем",
        "Разработка программного обеспечения",
        "Unix и скриптовые языки"
    ],

    "Машинное обучение и анализ данных": [
        "Python для анализа данных",
        "Введение в машинное обучение",
        "Основы машинного обучения",
        "Машинное обучение",
        "Технологии машинного обучения",
        "Машинное обучение на больших данных",
        "Компьютерное зрение",
        "Анализ изображений",
        "Рекомендательные системы",
        "Архитектура аналитических систем",
        "Методы интерпретации и визуализации данных",
        "Дополнительные главы машинного обучения",
        "Веб-поиск и ранжирование"
    ],

    "Проектирование и разработка высоконагруженных информационных систем": [
        "Алгоритмы и структуры данных",
        "Эффективные алгоритмы",
        "Базы данных",
        "Архитектура компьютера и операционные системы",
        "Технологии компьютерных сетей",
        "Параллельное программирование",
        "Алгоритмы для хранения данных",
        "Системный анализ и разработка сложных информационных систем",
        "Системный анализ и проектирование сложных систем",
        "Разработка программного обеспечения",
        "Управление разработкой ПО",
        "ИТ-архитектура предприятия"
    ],

    "Вычислительная биология и биоинформатика": [
        "Молекулярная биология и биотехнологии",
        "Биоинформатика ДНК, РНК и белков",
        "Алгоритмы в биоинформатике",
        "Структурная биоинформатика и молекулярная динамика",
        "Python для анализа данных",
        "Теория вероятностей и математическая статистика",
        "Машинное обучение",
        "Технологии машинного обучения",
        "Алгоритмы и структуры данных"
    ],

    "UX-аналитика и проектирование информационных систем": [
        "Человеко-ориентированный дизайн и прототипирование",
        "Человеко-машинный интерфейс",
        "Инженерия требований",
        "Системный анализ и проектирование сложных систем",
        "Системный анализ и разработка сложных информационных систем",
        "Проектирование дэшбордов и аналитических систем",
        "Методы интерпретации и визуализации данных",
        "Современные методы принятия решений",
        "Менеджмент ИТ-проектов"
    ]
}
